_posts/programming/2023-03-06-cppcoreguidelines-es2.html
---
layout: post
title: CppCoreGuidelines ES.2 请使用适当的抽象机制
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Prefer suitable abstractions to direct use of language features&rdquo;
</p>


<p>
理由
</p>

<p>
恰当的抽象（如库、类）比纯语言功能更接近应用概念。产生更短、更清晰、更可测的代码。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">read1</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span>&amp; <span style="color: #000000;">is</span><span style="color: #707183;">)</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">good</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7388d6;">&gt;</span> <span style="color: #000000;">res</span>;
    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>; is &gt;&gt; s;<span style="color: #7388d6;">)</span>
        res.push_back<span style="color: #7388d6;">(</span>s<span style="color: #7388d6;">)</span>;
    <span style="color: #7F0055; font-weight: bold;">return</span> res;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
更传统和底层的实现方式代码更长、更混乱、更难写正确、可能速度更慢：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">char</span>** <span style="color: #0000ff; font-weight: bold;">read2</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span>&amp; <span style="color: #000000;">is</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">maxelem</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">maxstring</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span>* <span style="color: #000000;">nread</span><span style="color: #707183;">)</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">bad: verbose and incomplete</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">res</span> = <span style="color: #7F0055; font-weight: bold;">new</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">char</span>*<span style="color: #7388d6;">[</span><span style="color: #110099;">maxelem</span><span style="color: #7388d6;">]</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">elemcount</span> = 0;
    <span style="color: #7F0055; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">is</span> &amp;&amp; <span style="color: #000000;">elemcount</span> &lt; maxelem<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">s</span> = <span style="color: #7F0055; font-weight: bold;">new</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">char</span><span style="color: #909183;">[</span>maxstring<span style="color: #909183;">]</span>;
        is.read<span style="color: #909183;">(</span>s, maxstring<span style="color: #909183;">)</span>;
        res<span style="color: #909183;">[</span>elemcount++<span style="color: #909183;">]</span> = s;
    <span style="color: #7388d6;">}</span>
    *nread = elemcount;
    <span style="color: #7F0055; font-weight: bold;">return</span> res;
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
如果再增加一些溢出检测和错误处理代码，程序会变得更加杂乱，还有个问题，我们还必须记得删除返回的指针和 C 风格的字符串数组。
</p>


<p>
强化
</p>
<ul class="org-ul">
<li>检查杂乱循环、嵌套循环、长函数、缺少的函数调用、少用内置类型的地方。还有圈复杂度。</li>
</ul>
